Revit 2027 API
IndependentTag.CanLeaderStartConditionBeAssigned Method
 Checks whether the LeaderStartCondition can be changed.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool CanLeaderStartConditionBeAssigned(
	LeaderStartCondition leaderStartCondition
)
Public Function CanLeaderStartConditionBeAssigned (
	leaderStartCondition As LeaderStartCondition
) As Boolean
public:
bool CanLeaderStartConditionBeAssigned(
	LeaderStartCondition leaderStartCondition
)
member CanLeaderStartConditionBeAssigned :
        leaderStartCondition : LeaderStartCondition -> bool
Parameters
leaderStartCondition LeaderStartCondition
 The LeaderStartCondition that will be checked to see if it can be assigned.
Return Value
Boolean
 True if the LeaderStartCondition of the tag can be assigned, or false otherwise.
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
Remarks
 The LeaderStartCondition controls how the leader start point attaches to the tag head. Material tags, material keynotes, and realistic rebar bending details can only use the attached leader start condition.
See Also
Reference
IndependentTag Class
Autodesk.Revit.DB Namespace